import styles from "./page.module.css";
import Section from "@/components/Section";
import CalculatorLab2 from "@/components/Calculators/DMT/CalculatorLab2";

export default function Lab1() {
    return (<>
        <h1 className={styles.h1}>Вибір рішення в умовах ризику</h1>
        <Section title={" Завдання на лабораторну роботу"}>
            <ol>
                <li> Отримати допуск до роботи. Отримати індивідуальне завдання.</li>
                <li>
                    Ознайомитись з призначенням критеріїв, вільно володіти елементами природи
                    та відношеннями між ними. Під час підготовки до лабораторної роботи
                    ознайомитись з теоретичними відомостями, що викладені в конспекті лекцій,
                    розділі 2.2 цих вказівок та в [1–4].
                </li>
                <li>
                    Отримати допуск до роботи. Погодити індивідуальне завдання з темою
                    випускної роботи.
                </li>
                <li>
                    Побудувати ПЗ згідно варіанту (темі випускної роботи). Необхідно забезпечити
                    введення елементів матриці; вибір одного з критеріїв, за яким знаходиться і
                    оцінюється краща альтернатива; виведення значень критеріїв і відповідних їм
                    альтернатив окремо; виведення кращих альтернатив за всіма критеріями відразу.
                    Студенти з парними номерами у списку групи шукають «гіршу» альтернативу.
                </li>
                <li>Надати текстовий опис природи і її станів, а також системи, що проектується.</li>
            </ol>
        </Section>
        <h1 className={styles.h1}>Калькулятор</h1>
        <CalculatorLab2/>
    </>);
}
