import styles from "./page.module.css";
import CalculatorLab1 from "../../../../components/Calculators/DMT/CalculatorLab1";
import Section from "@/components/Section";

export default function Lab1() {
    return (<>
        <h1 className={styles.h1}>Аналіз альтернатив в умовах невизначеності</h1>

        <Section title={"Мета"}><p>
            Засвоєння навичок оптимізації рішень в умовах невизначеності
        </p></Section>

        <Section title={"Завдання"}><p>
            Побудувати програмний засіб (ПЗ) згідно варіанту (темі випускної роботи).
            Необхідно забезпечити введення елементів матриці; вибір одного з критеріїв, за
            яким знаходиться і оцінюється краща альтернатива; виведення значень критеріїв
            і відповідних їм альтернатив окремо; виведення кращих альтернатив за всіма
            критеріями відразу. Студенти з парними номерами у списку групи шукають
            «гіршу» альтернативу.
        </p></Section>

        {/*<Section title={"Бізнес-логіка "}>*/}
        {/*    <p>*/}
        {/*        Пошук альтернативи за критерієм максимаксу передбачає віднаходження найбільшого елементу*/}
        {/*        матриці. Ряд з цим елементом і є кращою альтернативою.*/}
        {/*    </p>*/}
        {/*    <p>*/}
        {/*        При визначенні кращої альтернативи за критерієм Вальда, знаходяться найгірші*/}
        {/*        значення у кожному рядку стратегій, а потім з отриманих результатів вибирається найкраще значення.*/}
        {/*        Стратегія з цим елементом є шуканою альтернативою.*/}
        {/*    </p>*/}
        {/*    <p>*/}
        {/*        При визначенні кращої альтернативи за критерієм Гурвіца, вводиться додатковий параметр песимізму Q.*/}
        {/*        При Q=0 критерій Гурвіца збігається з максимаксним критерієм, а при Q=1 – із критерієм Вальда.*/}
        {/*        У кожній стратегії виконується множення найгіршого значення на Q та найкращого значення на 1 - Q та*/}
        {/*        сумується. Стратегія з кращим значенням відповідає кращій альтернативі.*/}
        {/*    </p>*/}
        {/*    <p>*/}
        {/*        Для знаходження кращої альтернативи за критерієм Байєса-Лапласа калькулятор доповнюється ще*/}
        {/*        однією таблицею значень ймовірностей стану природи кожного критерію.*/}
        {/*        Знаходиться нова матриця, для цього всі значення множаться на відповідні значенню критерії.*/}
        {/*        Значення кожного рядка підсумовуються. Стратегія з кращим значенням відповідає кращій альтернативі.*/}
        {/*    </p>*/}
        {/*</Section>*/}

        <Section title={"Калькулятор"}>
            <CalculatorLab1/>
        </Section>
    </>);
}
